---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextText
source: html/ac68b55f-202f-7c1c-b028-4bd357118c0a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextText Property

"Text"

## Syntax (C#)
```csharp
public static ForgeTypeId TextText { get; }
```